Can't move element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotMoveElement { get; }
  Visual Basic
Public Shared ReadOnly Property CannotMoveElement As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotMoveElement {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace